# list
# 二维数组 嵌套列表
print(type([1, 2, 3, '23', False, ['33']]))

# 截取
print([1, 2, 3][0])

# 切片
print([1, 2, 3][0:2])  # [1,2]
print([1, 2, 3][-1:])  # [3]

# 步长
print([1, 2, 3][0:3:2])  # [1,3]

# 更改元素的值
a = [1, 2, 3]
a[0] = 100
print(a)  # [100, 2, 3]

# 删除元素
a = [1, 2, 3]
del a[0]
print(a)  # [2, 3]

# 数组加法
a = [1, 2, 3]
b = [4, 5, 6]
print(a + b)  # [1, 2, 3, 4, 5, 6]

# 数组乘法
a = [1, 2, 3]
print(a * 3)  # [1, 2, 3, 1, 2, 3, 1, 2, 3]

# 数组长度
a = [1, 2, 3]
print(len(a))  # 3

# 数组最大值
a = [1, 2, 3]
print(max(a))  # 3
